[{
   "date": "Present Day",
   "event": "Applying to Law Schools",
   "category": "academic",
   "icon": "balance",
   "description": "I am currently applying to law schools, with an interest in [[intellectual property::A work or invention that is the result of creativity, such as a manuscript or a design, to which one has rights and for which one may apply for a patent, copyright, trademark, etc.]] and [[technology law::A broad branch of law dealing with the legal aspects of technology, the internet, intellectual property, and digital innovations.]]."
  },
  {
   "date": "January 2025",
   "event": "Joined {{Digital Science::A technology company with its headquarters in London, England, and which focuses on strategic investments into startup companies that support the research lifecycle.}} as a Software Engineer",
   "category": "professional",
   "icon": "science",
   "description": "Started a new role focusing on software development for webapps and services for the {{National Institutes of Health::The primary agency of the United States federal government responsible for biomedical and public health research.}}."
  },
    {
   "date": "October 2024",
   "event": "Developed Cyforge-Flow",
   "category": "personal",
   "icon": "flow",
   "description": "Released a rapid-prototyping tool based on my open-sourced Cyforge module."
  },
  {
   "date": "July 2024",
   "event": "Developed Cyforge for Python",
   "category": "personal",
   "icon": "memory",
   "description": "Published a Python module available on [PyPI](https://pypi.org/project/cyforge/) for designing modular AI systems."
  },
  {
   "date": "June 2023",
   "event": "Developed and trained an [[LLM (large language model):: A model of the human brain's ability to produce natural language, trained with self-supervised machine learning on a vast amount of text, designed for natural language processing tasks, especially language generation.]] and chatbot",
   "category": "personal",
      "icon": "assistant",
   "description": "Created an assistant based on previous experience with parallel processing and model training."
  },
  {
   "date": "May 2023",
   "event": "Ran my first Half Marathon",
   "category": "personal",
    "icon": "running",
   "description": "Participated in Boston's Run to Remember Half Marathon."
  },
  {
   "date": "April 2023",
   "event": "Completed #[Boston University Paralegal Studies Certification::something cool]",
   "category": "academic",
   "description": "Finished a 14-week online program to learn how to use legal technologies and tools, and to gain fundamental legal research skills."
  },

  {
   "date": "May 2022",
   "event": "Graduated from Northeastern University Honors College of Engineering BS/MS Program",
   "category": "academic",
   "description": "Left with a combined Bachelor's in Computer Engineering and Computer Science, and a Master's in Electrical and Computer Engineering with a concentration in Computer Systems."
  },
  {
   "date": "June 2021",
   "event": "Started at Dell Technologies as a Software Engineer II",
   "category": "professional",
    "icon": "computer",
   "description": "Following my internship, accepted a full-time position while finishing my BS/MS program."
  },
    {
   "date": "April 2021",
   "event": "Completed DeepLift capstone project for Northeastern University",
   "category": "academic",
   "icon": "repair",
   "description": "Worked with a team of other students to develop a fitness mirror with a custom-built computer vision system and phone app to track and analyze user performance. We used a Jetson Xavier NX, OpenCV, and TensorFlow to create a real-time feedback system for users."
  },
  {
   "date": "June 2020",
   "event": "Started at Dell Technologies as a Storage Graduate Intern",
   "category": "professional",
    "icon": "computer",
   "description": "Started a summer internship, where I worked to develop automated testing tools for Dell's storage systems."
  },
  {
   "date": "January 2020",
   "event": "Joined Draper Laboratory as a Machine Intelligence Co-op",
   "category": "professional",
   "description": "Joined the Machine Intelligence Group, where I worked developing computer vision and machine learning algorithms for autonomous ocean buoys. We hoped for pictures of submarines, but we mostly found seals and other marine life."
  },
    {
   "date": "January 2019",
   "event": "Elected Treasurer of Northeastern University's Beta Gamma Epsilon Alpha Chapter",
   "category": "personal",
    "icon": "bank",
   "description": "Took responsibility of my engineering fraternity's finances for the year of our centennial commemoration (founded February 12, 1919)."
  },
    {
   "date": "January 2019",
   "event": "Became a Course Assistant for Accelerated Fundamentals of Computer Science II",
   "category": "professional",
    "icon": "dataObject",
   "description": "Began working for another computer science course."
  },
  {
   "date": "July 2018",
   "event": "Started at Waters Corporation as a Software Engineering Co-op",
   "category": "professional",
    "icon": "biotech",
   "description": "Took a co-op position at Waters Corporation, where I developed tests for High Performance Liquid Chromatography (HPLC) systems' software."
  },
  {
   "date": "September 2017",
   "event": "Became a Teaching Assistant for Discrete Structures",
   "category": "professional",
    "icon": "discrete",
   "description": "Took the opportunity to lead weekly recitations (small, focused lectures) in addition to grading and tutoring."
  },
    {
   "date": "April 2017",
   "event": "Published in the 2017 #[ASEE::The American Society for Engineering Education (ASEE) is a non-profit member association, founded in 1893, dedicated to promoting and improving engineering and engineering technology education. The purpose of ASEE is the advancement of education in all of its functions which pertain to engineering and allied branches of science and technology, including the processes of teaching and learning, counseling, research, extension services and public relations.]-NE Conference Proceedings",
   "category": "academic",
    "icon": "greenEnergy",
   "description": "Co-authored a paper with a professor and other first-year engineering students: [*Renewable Energy Generation from Footsteps using Piezoelectronics*](https://asee-ne.org/conferences/aseene/2017/index.php/aseene/aseene2017/paper/view/11)."
  },
  {
   "date": "September 2016",
   "event": "Entered at Northeastern University Honors Program as an Undeclared Engineering Student",
   "category": "academic",
    "icon": "backpack",
   "description": "In pursuit of a law career focused in technology, decided to study engineering. I would later declare my major as combined Computer Engineering and Computer Science."
  },
  {
   "date": "May 2016",
   "event": "Graduated from #[Milford High School::todo]",
   "category": "academic",
   "description": "Ranked 5th / approx. 300, as an #[AP Scholar with Distinction::Granted to students who receive an average score of at least 3.5 on all AP Exams taken, and scores of 3 or higher on five or more of these exams.], president of the #[National Honors Society::One of the oldest, largest, and most widely recognized cocurricular student organizations in American high schools, with 1.4 million members. The purpose of the NHS is to create enthusiasm for scholarship, to recognize outstanding students, to stimulate a desire to render service, to promote leadership, and to develop character in the students of secondary schools.], captain of the #[MBA Mock Trial Team::Places high school teams from across Massachusetts in simulated courtroom situations where students assume the roles of lawyers, defendants and witnesses in hypothetical cases. More than 1,000 students across the state participate in the competition, and more than 100 lawyers from communities around the state preside over the mock trials as judges, and coaches for the students.], president of the #[Junior State of America::Formerly the Junior Statesmen of America, abbreviated JSA, was an American non-partisan youth organization. The purpose of JSA was to help high school students acquire leadership skills and the knowledge necessary to be effective debaters and civic participants. JSA was sponsored by the Junior State of America Foundation Inc. (JSAF, a 501c(3) non-profit corporation), which also operated the JSA Summer Schools. On August 2nd, 2024, it was announced that the organization would be closing and ceasing operations on August 31, 2024.] chapter, member of the #[Tri-M Music Honors Society::todo], member of the #[Central District MMEA Choir::todo] ([[baritone::todo]]), varsity tennis player, theater member, and {{pinchaser::A person who performs maintenance and repairs on bowling alley pinsetters, clearing jams and resetting machines.}}."
  },
  {
   "date": "January 2016",
   "event": "Started at PINZ Entertainment as a {{Pinchaser::A person who performs maintenance and repairs on bowling alley pinsetters, clearing jams and resetting machines.}}",
   "category": "professional",
   "icon": "handyman",
   "description": "Joined the gaming staff at my local bowling alley, and became an experienced bowling mechanic over college summers, fixing the pinspotters, laser tag systems, and arcade machines. I bowled a 216 once and retired."
  },
  {
   "date": "May 2015",
   "event": "Started at Five Guys Burgers and Fries as a Crew Member",
   "category": "professional",
   "icon": "fastfood",
   "description": "Got my first job as a cashier and line cook, learning how to grill the meanest burger west of I-495."
  },
  {
   "date": "December 2014",
   "event": "Began learning Piano",
   "category": "personal",
   "icon": "piano",
   "description": "Was gifted a keyboard after joining my high school's theater program. I've been playing ever since. My favorite song to play is [Nocturne Op. 55 No. 1](https://www.youtube.com/watch?v=NONg06Pf0v8)."
  }
]