[{
   "date": "Present Day",
   "event": "Applying to Law Schools",
   "category": "academic",
   "icon": "balance",
   "description": "I am currently applying to law schools, with a focus on intellectual property and technology law."
  },
  {
   "date": "January 2025",
   "event": "Joined Digital Science as a Software Engineer",
   "category": "professional",
   "icon": "science",
   "description": "Started a new role focusing on software development for webapps and services for the National Institutes of Health."
  },
    {
   "date": "October 2024",
   "event": "Developed Cyforge-Flow",
   "category": "personal",
   "icon": "flow",
   "description": "Released a rapid-prototyping tool based on my open-sourced Cyforge module."
  },
  {
   "date": "July 2024",
   "event": "Developed Cyforge for Python",
   "category": "personal",
   "icon": "memory",
   "description": "Published a Python module available on [PyPI](https://pypi.org/project/cyforge/) for designing modular AI systems."
  },
  {
   "date": "June 2023",
   "event": "Developed and trained an LLM and chatbot",
   "category": "personal",
      "icon": "assistant",
   "description": "Created an assistant based on previous experience with parallel processing and model training."
  },
  {
   "date": "April 2023",
   "event": "Completed Boston University Paralegal Studies Certification",
   "category": "academic",
   "description": "Finished a 14-week online program to learn how to use legal technologies and tools, and to gain fundamental legal research skills."
  },

  {
   "date": "May 2022",
   "event": "Graduated from Northeastern University Honors College of Engineering BS/MS Program",
   "category": "academic",
   "description": "Left with a combined Bachelor's in Computer Engineering and Computer Science, and a Master's in Electrical and Computer Engineering with a concentration in Computer Systems"
  },
  {
   "date": "June 2021",
   "event": "Started at Dell Technologies as a Software Engineer II",
   "category": "professional",
    "icon": "computer",
   "description": "Following my internship, accepted a full-time position while finishing my BS/MS program."
  },
    {
   "date": "April 2021",
   "event": "Completed DeepLift capstone project for Northeastern University",
   "category": "academic",
   "icon": "repair",
   "description": "Worked with a team of other students to develop a fitness mirror with a custom-built computer vision system and phone app to track and analyze user performance. We used a Jetson Xavier NX, OpenCV, and TensorFlow to create a real-time feedback system for users."
  },
  {
   "date": "June 2020",
   "event": "Started at Dell Technologies as a Storage Graduate Intern",
   "category": "professional",
    "icon": "computer",
   "description": "Started a summer internship, where I worked to develop automated testing tools for Dell's storage systems."
  },
  {
   "date": "January 2020",
   "event": "Joined Draper Laboratory as a Machine Intelligence Co-op",
   "category": "professional",
   "description": "Joined the Machine Intelligence Group, where I worked developing computer vision and machine learning algorithms for autonomous ocean buoys. We hoped for pictures of submarines, but we mostly found seals and other marine life."
  },
    {
   "date": "January 2019",
   "event": "Became a Course Assistant for Accelerated Fundamentals of Computer Science II",
   "category": "professional",
    "icon": "dataObject",
   "description": "Began working for another computer science course."
  },
  {
   "date": "July 2018",
   "event": "Started at Waters Corporation as a Software Engineering Co-op",
   "category": "professional",
    "icon": "biotech",
   "description": "Took a co-op position at Waters Corporation, where I developed tests for High Performance Liquid Chromatography (HPLC) systems' software."
  },
  {
   "date": "September 2017",
   "event": "Became a Teaching Assistant for Discrete Structures",
   "category": "professional",
    "icon": "discrete",
   "description": "Took the opportunity to lead weekly recitations (small, focused lectures) in addition to grading and tutoring."
  },
    {
   "date": "April 2017",
   "event": "Published in the 2017 ASEE-NE Conference Proceedings",
   "category": "academic",
    "icon": "greenEnergy",
   "description": "Co-authored a paper with a professor and other first-year engineering students: *Renewable Energy Generation from Footsteps using Piezoelectronics*"
  },
  {
   "date": "September 2016",
   "event": "Entered at Northeastern University Honors Program as an Undeclared Engineering Student",
   "category": "academic",
    "icon": "backpack",
   "description": "In pursuit of a law career focused in technology, decided to study engineering. I would later declare my major as combined Computer Engineering and Computer Science."
  },
  {
   "date": "May 2016",
   "event": "Graduated from Milford High School",
   "category": "academic",
   "description": "Ranked 5th / approx. 300, as an AP Scholar with Distinction, president of the National Honors Society, captain of the MBA Mock Trial Team, president of the Junior State of America chapter, member of the Tri-M Music Honors Society, member of the Central District MMEA choir (baritone), varsity tennis player, theater member, and pinchaser."
  },
  {
   "date": "January 2016",
   "event": "Started at PINZ Entertainment as a Pinchaser / Bowling Mechanic",
   "category": "professional",
   "icon": "handyman",
   "description": "Joined the gaming staff at my local bowling alley, and became an experienced bowling mechanic over college summers, fixing the pinspotters, laser tag systems, and arcade machines. I bowled a 216 once and retired."
  },
  {
   "date": "May 2015",
   "event": "Started at Five Guys Burgers and Fries as a Crew Member",
   "category": "professional",
   "icon": "fastfood",
   "description": "Got my first job as a cashier and line cook, learning how to grill the meanest burger west of I-495."
  },
  {
   "date": "December 2014",
   "event": "Began learning Piano",
   "category": "personal",
   "icon": "piano",
   "description": "Was gifted a keyboard after joining my high school's theater program. I've been playing ever since. My favorite song to play is [Nocturne Op. 55 No. 1](https://www.youtube.com/watch?v=NONg06Pf0v8)."
  }
]